# Chinese (Mainland) Economic Data - Demography Data

In [1]:
import dai
import pandas as pd
pd.set_option('display.max_row', 6)
pd.set_option('display.max_column', None)

## 1. Population

In [2]:
dai.query("""
SELECT *
FROM cn_macro_population_yearly
""").df()

,year,population,male,female,urban,rural,birth_rate,death_rate,growth_rate
0,2004,129988.0,66976.0,63012.0,54283.0,75705.0,12.29,6.42,5.87
1,2005,130756.0,67375.0,63381.0,56212.0,74544.0,12.40,6.51,5.89
2,2006,131448.0,67728.0,63720.0,58288.0,73160.0,12.09,6.81,5.28
...,...,...,...,...,...,...,...,...,...
17,2021,141260.0,72311.0,68949.0,91425.0,49835.0,7.52,7.18,0.34
18,2022,141175.0,72206.0,68969.0,92071.0,49104.0,6.77,7.37,-0.60
19,2023,140967.0,72032.0,68935.0,93267.0,47700.0,6.39,7.87,-1.48

## 2. Population Segmentation

### 2.1 Population Segmentation - Age & Dependency

In [3]:
dai.query("""
SELECT *
FROM cn_macro_population_age_dependency_yearly
""").df()

,year,population,age_between_0_and_14,age_between_15_and_64,age_over_65,dependency_ratio,children_dependency_ratio,old_dependency_ratio
0,2004,129988.0,27947.000,92184.000,9857.000,41.0,30.3,10.7
1,2005,130756.0,26504.000,94197.000,10055.000,38.8,28.1,10.7
2,2006,131448.0,25961.000,95068.000,10419.000,38.3,27.3,11.0
...,...,...,...,...,...,...,...,...
17,2021,141260.0,24678.000,96526.000,20056.000,46.3,25.6,20.8
18,2022,141175.0,23908.000,96289.000,20978.000,46.6,24.8,21.8
19,2023,140967.0,22977.621,96280.461,21708.918,46.5,24.0,22.5

### 2.2 Population Segmentation - Age & Gender

In [4]:
# Absolute
dai.query("""
SELECT *
FROM cn_macro_population_age_gender_yearly
""").df()

,year,gender,population,age_between_0_and_4,age_between_5_and_9,age_between_10_and_14,age_between_15_and_19,age_between_20_and_24,age_between_25_and_29,age_between_30_and_34,age_between_35_and_39,age_between_40_and_44,age_between_45_and_49,age_between_50_and_54,age_between_55_and_59,age_between_60_and_64,age_between_65_and_69,age_between_70_and_74,age_between_75_and_79,age_between_80_and_84,age_between_85_and_89,age_between_90_and_94,age_over_95
0,2004,both,1253065.0,61874.0,76221.0,103771.0,109259.0,79604.0,88490.0,117954.0,122574.0,100595.0,89609.0,86438.0,61775.0,47599.0,40062.0,32538.0,19159.0,10469.0,3727.0,1115.0,234.0
1,2004,female,615898.0,27784.0,34788.0,48850.0,52676.0,40440.0,44959.0,58944.0,61084.0,50038.0,44289.0,42563.0,30316.0,23333.0,19952.0,16442.0,10047.0,6082.0,2379.0,759.0,171.0
2,2004,male,637167.0,34089.0,41433.0,54921.0,56583.0,39164.0,43530.0,59010.0,61490.0,50558.0,45320.0,43875.0,31459.0,24266.0,20110.0,16095.0,9111.0,4387.0,1348.0,355.0,63.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
57,2023,both,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
58,2023,female,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
59,2023,male,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
# Ratio
dai.query("""
SELECT *
FROM cn_macro_age_gender_ratio_yearly
""").df()

,year,gender_ratio,age_between_0_and_4,age_between_5_and_9,age_between_10_and_14,age_between_15_and_19,age_between_20_and_24,age_between_25_and_29,age_between_30_and_34,age_between_35_and_39,age_between_40_and_44,age_between_45_and_49,age_between_50_and_54,age_between_55_and_59,age_between_60_and_64,age_between_65_and_69,age_between_70_and_74,age_between_75_and_79,age_between_80_and_84,age_between_85_and_89,age_between_90_and_94,age_over_95
0,2004,103.45,122.69,119.10,112.43,107.42,96.85,96.82,100.11,100.67,101.04,102.33,103.08,103.77,104.00,100.79,97.89,90.68,72.12,56.68,46.80,36.830000
1,2005,102.19,122.66,119.30,114.20,107.88,93.13,94.43,96.75,96.99,98.62,100.72,101.40,103.91,105.13,102.96,97.01,87.83,73.50,56.71,43.35,32.283778
2,2006,102.71,120.72,123.05,116.99,111.99,95.84,93.79,96.30,96.74,97.90,100.00,101.51,102.38,104.21,104.73,97.54,91.37,74.00,60.48,47.86,36.890000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17,2021,104.61,110.37,112.96,114.86,116.17,113.20,110.68,106.69,105.76,105.00,103.73,101.74,100.80,99.88,96.51,94.08,89.30,82.27,69.86,63.07,43.200000
18,2022,104.43,109.88,112.22,114.69,115.77,113.52,111.36,107.50,105.54,105.14,103.73,101.90,100.47,99.07,96.86,93.19,89.37,82.44,71.36,62.56,50.360000
19,2023,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### 2.3 Population Segmentation - Marital

In [6]:
# Ratio
dai.query("""
SELECT *
FROM cn_macro_marital_population_yearly
""").df()

,year,age_over_15,male_age_over_15,female_age_over_15,never_married,male_never_married,female_never_married,first_married,male_first_married,female_first_married,remarried,male_remarried,female_remarried,divorced,male_divorced,female_divorced,widowed,male_widowed,female_widowed,having_spouse,male_having_spouse,female_having_spouse
0,2004,1011199.0,506724.0,504475.0,197561.0,114158.0,83403.0,728431.0,360710.0,367721.0,16527.0,7746.0,8781.0,10777.0,6402.0,4375.0,57903.0,17708.0,40195.0,NaN,NaN,NaN
1,2005,13664737.0,6786677.0,6878061.0,2619360.0,1524886.0,1094474.0,9824784.0,4801807.0,5022977.0,301209.0,138947.0,162262.0,135625.0,81486.0,54139.0,783760.0,239551.0,544209.0,NaN,NaN,NaN
2,2006,972385.0,484183.0,488202.0,188559.0,109508.0,79051.0,698582.0,342467.0,356115.0,18083.0,8374.0,9710.0,10199.0,6199.0,3999.0,56962.0,17635.0,39327.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17,2021,1232677.0,625238.0,607439.0,238753.0,142861.0,95891.0,NaN,NaN,NaN,NaN,NaN,NaN,29002.0,15988.0,13013.0,69725.0,18709.0,51016.0,895198.0,447679.0,447519.0
18,2022,1199109.0,607967.0,591141.0,236783.0,142433.0,94349.0,NaN,NaN,NaN,NaN,NaN,NaN,28878.0,16346.0,12532.0,68901.0,18453.0,50448.0,864547.0,430734.0,433813.0
19,2023,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### 2.4 Population Segmentation - Family

In [7]:
dai.query("""
SELECT *
FROM cn_macro_family_household_yearly
""").df()

,year,family_household,one_persons,two_persons,three_persons,four_persons,five_persons,six_persons,seven_persons,eight_persons,nine_persons,over_ten_persons
0,2004,367617.0,28761.0,72225.0,115568.0,80242.0,45584.0,16183.0,5349.0,2149.0,850.0,706.0
1,2005,5286554.0,567455.0,1294464.0,1577147.0,1014177.0,538035.0,199448.0,58212.0,22028.0,8383.0,7205.0
2,2006,368180.0,33646.0,89000.0,112944.0,73757.0,39697.0,13228.0,3732.0,1352.0,461.0,365.0
...,...,...,...,...,...,...,...,...,...,...,...,...
17,2021,510132.0,86969.0,124057.0,110090.0,94679.0,48583.0,28556.0,10154.0,3742.0,1648.0,1654.0
18,2022,497176.0,83354.0,118606.0,105506.0,92161.0,49122.0,29852.0,11036.0,4052.0,1730.0,1757.0
19,2023,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### 2.5 Population Segmentation - Household

In [8]:
dai.query("""
SELECT *
FROM cn_macro_household_population_yearly
""").df()

,year,household,family_household,collective_household,family_household_population,family_household_male_population,family_household_female_population,collective_household_population,collective_household_male_population,collective_household_female_population
0,2004,370785.0,367617.0,3168.0,1236207.0,628037.0,608170.0,16858.0,9130.0,7728.0
1,2005,5391013.0,5286554.0,104459.0,16570406.0,8354106.0,8216300.0,415360.0,230777.0,184584.0
2,2006,374053.0,368180.0,5873.0,1168454.0,590787.0,577667.0,24212.0,13516.0,10696.0
...,...,...,...,...,...,...,...,...,...,...
17,2021,528365.0,510132.0,18233.0,1412402.0,717732.0,694670.0,81652.0,46110.0,35542.0
18,2022,513643.0,497176.0,16467.0,1372731.0,696819.0,675912.0,71264.0,40812.0,30452.0
19,2023,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### 2.6 Population Segmentation - Household Register

In [9]:
dai.query("""
SELECT *
FROM cn_macro_household_register_population_yearly
""").df()

,year,population,male,female,residing,male_residing,female_residing,residing_6months,male_residing_6months,female_residing_6months,household_unsettle,male_household_unsettle,female_household_unsettle,residing_abroad,male_residing_abroad,female_residing_abroad
0,2004,1253065.0,637167.0,615898.0,1143642.0,582302.0,561340.0,NaN,NaN,NaN,6467.0,3257.0,3211.0,NaN,NaN,NaN
1,2005,16985766.0,8584882.0,8400884.0,14956470.0,7559833.0,7396636.0,1945894.0,983525.0,962370.0,82374.0,40905.0,41469.0,1029.0,619.0,410.0
2,2006,1192666.0,604303.0,588363.0,1070090.0,543014.0,527076.0,NaN,NaN,NaN,5886.0,2924.0,2963.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17,2021,1494054.0,763842.0,730212.0,1041754.0,530881.0,510873.0,445361.0,229119.0,216242.0,3562.0,1949.0,1612.0,3377.0,1892.0,1485.0
18,2022,1443996.0,737631.0,706364.0,1025198.0,521861.0,503337.0,412709.0,212494.0,200215.0,3254.0,1630.0,1624.0,2834.0,1646.0,1187.0
19,2023,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### 2.7 Population Segmentation - Education

In [10]:
dai.query("""
SELECT *
FROM cn_macro_education_population_yearly
""").df()

,year,age_over_6,male_age_over_6,female_age_over_6,no_schooling,male_no_schooling,female_no_schooling,primary_school,male_primary_school,female_primary_school,junior_secondary_school,male_junior_secondary_school,female_junior_secondary_school,senior_secondary_school,male_senior_secondary_school,female_senior_secondary_school,college,male_college,female_college
0,2004,1177817.0,595688.0,582128.0,107922.0,31281.0,76641.0,381371.0,185506.0,195865.0,462796.0,251281.0,211515.0,157783.0,88282.0,69501.0,67945.0,39339.0,28607.0
1,2005,15878355.0,7975386.0,7902969.0,1646360.0,450088.0,1196272.0,5285045.0,2581633.0,2703412.0,6088659.0,3316912.0,2771747.0,1975098.0,1120964.0,854134.0,883192.0,505789.0,377404.0
2,2006,1118855.0,563752.0,555103.0,98335.0,26886.0,71448.0,370014.0,178576.0,191438.0,436273.0,236899.0,199374.0,144652.0,81865.0,62787.0,69581.0,39525.0,30056.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17,2021,1402340.0,715667.0,686673.0,51186.0,14686.0,36501.0,365918.0,170546.0,195372.0,487144.0,263182.0,223962.0,233626.0,129645.0,103981.0,264467.0,137608.0,126857.0
18,2022,1363035.0,695142.0,667894.0,51393.0,14948.0,36444.0,355354.0,167013.0,188341.0,467993.0,252064.0,215929.0,222881.0,123426.0,99455.0,265414.0,137692.0,127723.0
19,2023,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
dai.query("""
SELECT *
FROM cn_macro_population_illiterate_yearly
""").df()

,year,age_over_15,male_age_over_15,female_age_over_15,illiterate,male_illiterate,female_illiterate
0,2004,1011199.0,506724.0,504475.0,104324.0,29338.0,74986.0
1,2005,13664737.0,6786677.0,6878061.0,1508706.0,397877.0,1110828.0
2,2006,972385.0,484183.0,488202.0,90564.0,23560.0,67004.0
...,...,...,...,...,...,...,...
17,2021,1232677.0,625238.0,607439.0,39531.0,9386.0,30145.0
18,2022,1199109.0,607967.0,591141.0,40704.0,9614.0,31089.0
19,2023,NaN,NaN,NaN,NaN,NaN,NaN

## 3. Life Expect

In [12]:
dai.query("""
SELECT *
FROM cn_macro_life_expect_yearly
""").df()

    year  life_expect  male_life_expect  female_life_expect
0   2004          NaN               NaN                 NaN
1   2005        72.95             70.83               75.25
2   2006          NaN               NaN                 NaN
..   ...          ...               ...                 ...
17  2021          NaN               NaN                 NaN
18  2022          NaN               NaN                 NaN
19  2023          NaN               NaN                 NaN

[20 rows x 4 columns]